app/controllers/medications_controller.rb

  def index
    @medications = Medication.all
---
SELECT "medications".* FROM "medications"

  def show
    @medication = Medication.find(params[:id])
---
SELECT "medications".* FROM "medications" WHERE "medications"."id" = ? LIMIT 1  [["id", "2"]]

  def edit
    @medication = Medication.find(params[:id])
---
SELECT "medications".* FROM "medications" WHERE "medications"."id" = ? LIMIT 1  [["id", "4"]]

  def create
    @medication = Medication.new(params[:medication])

    respond_to do |format|
      if @medication.save
        @medication.create_reminders(5)
---
INSERT INTO "medications" ("bottle_size", "created_at", "dosage_quant", "dosage_size", "drug", "frequency", "name", "notes", "period", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "reminders" ("created_at", "date", "medication_id", "message", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)

  def update
    @medication = Medication.find(params[:id])

    respond_to do |format|
      if @medication.update_attributes(params[:medication])
        @medication.create_reminders(5)
---
SELECT "medications".* FROM "medications" WHERE "medications"."id" = ? LIMIT 1  [["id", "4"]]
UPDATE "medications" SET "notes" = 'test edited', "updated_at" = '2013-06-12 20:25:07.218353' WHERE "medications"."id" = 5
INSERT INTO "reminders" ("created_at", "date", "medication_id", "message", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)