app/controllers/reminders_controller.rb

  def index
    @reminders = Reminder.all
---
SELECT "reminders".* FROM "reminders"

  def show
    @reminder = Reminder.find(params[:id])
---
SELECT "reminders".* FROM "reminders" WHERE "reminders"."id" = ? LIMIT 1  [["id", "4"]]